lucasmoraeseng/STM3205P/3.Firmware/STM3205P/Core/Inc/display.h
/* ###################################################################
**     Filename    : display.
**     Project     : STM3205P
**     Processor   :
**     Version     : Driver 01.00
**     Compiler    : GNU C Compiler
**     Date/Time   : Oct 6, 2025, 5:07:02 PM
**     Abstract    :
**     Author	   : lucas
**
**         This module contains user's application code.
**     Settings    :
**     Contents    :
**         No public methods
**
** ###################################################################*/

#ifndef SRC_DISPLAY_H_
#define SRC_DISPLAY_H_

//--------------------------------------------------------------------
// Includes
//--------------------------------------------------------------------
#include "HAL_74HC595.h"
#include "data_types.h"
#include "stm32f1xx_hal.h"
#include <math.h>
#include <stdint.h>

//--------------------------------------------------------------------
// Definitions
//--------------------------------------------------------------------
#define STCP2_Pin GPIO_PIN_1
#define STCP2_GPIO_Port GPIOB
#define SHCP2_Pin GPIO_PIN_10
#define SHCP2_GPIO_Port GPIOB
#define SD2_Pin GPIO_PIN_11
#define SD2_GPIO_Port GPIOB
#define display1_Pin GPIO_PIN_12
#define display1_GPIO_Port GPIOB
#define display2_Pin GPIO_PIN_13
#define display2_GPIO_Port GPIOB
#define display3_Pin GPIO_PIN_14
#define display3_GPIO_Port GPIOB
#define display4_Pin GPIO_PIN_15
#define display4_GPIO_Port GPIOB
#define display5_Pin GPIO_PIN_8
#define display5_GPIO_Port GPIOA

// Display 1
#define disp1_0 0xFA
#define disp1_1 0x22
#define disp1_2 0xB9
#define disp1_3 0xAB
#define disp1_4 0x63
#define disp1_5 0xCB
#define disp1_6 0xDB
#define disp1_7 0xA2
#define disp1_8 0xFB
#define disp1_9 0xEB
#define disp1_A 0xF3
#define disp1_B 0x5B
#define disp1_C 0xD8
#define disp1_D 0x3B
#define disp1_E 0xD9
#define disp1_F 0xD1
#define disp1_H 0x73
#define disp1_L 0x58
#define disp1_P 0xF1
#define disp1_U 0x7A
#define disp1_n 0x13
#define disp1_o 0x1B
#define disp1_r 0x11
#define disp1_t 0x59
#define disp1_y 0x6B
#define disp1_dash 0x01
#define disp1_underscore 0x08
#define disp1_equal 0x09
#define disp1_degree 0xE1
#define disp1_clear 0x00

// Display 2
#define disp2_0 0xFA
#define disp2_1 0x82
#define disp2_2 0xB9
#define disp2_3 0xAB
#define disp2_4 0xC3
#define disp2_5 0x6B
#define disp2_6 0x7B
#define disp2_7 0xA2
#define disp2_8 0xFB
#define disp2_9 0xEB
#define disp2_A 0xF3
#define disp2_B 0x5B
#define disp2_C 0x78
#define disp2_D 0x9B
#define disp2_E 0x79
#define disp2_F 0x71
#define disp2_H 0xD3
#define disp2_L 0x58
#define disp2_P 0xF1
#define disp2_U 0xDA
#define disp2_n 0x13
#define disp2_o 0x1B
#define disp2_r 0x11
#define disp2_t 0x59
#define disp2_y 0xCB
#define disp2_dash 0x1
#define disp2_underscore 0x8
#define disp2_equal 0x9
#define disp2_degree 0xE1
#define disp2_clear 0x0

#define disp_dot 0x04

//--------------------------------------------------------------------
// Typedef enum
//--------------------------------------------------------------------

//--------------------------------------------------------------------
// Typedef structs
//--------------------------------------------------------------------
// Structure to hold separated digits
typedef struct
{
    uint8_t d1;     // Thousands / tens / int part
    uint8_t d1_dot; // Dot for d1
    uint8_t d2;     // Hundreds / units
    uint8_t d2_dot; // Dot for d2
    uint8_t d3;     // Tens / tenths
    uint8_t d3_dot; // Dot for d3
    uint8_t d4;     // Units / hundredths
    uint8_t d4_dot; // Dot for d4
} Digits4_t;

typedef struct
{
    Digits4_t display1;
    Digits4_t display2;
    HAL_74HC595_t hAL_74HC595;
    uint8_t disp_cnt;
    uint8_t blink_display; // 0 - none; 1 - display1; 2 - display2
    uint8_t blink_state;   // 0 - off; 1 - on
    uint8_t blink_index;
    uint8_t ledOVP;
    uint8_t ledOCP;
    uint8_t ledCC;
    uint8_t ledCV;
    uint8_t ledOUT;
    uint8_t ledM1;
    uint8_t ledM2;
    uint8_t ledM3;
    uint8_t ledM4;
    uint8_t ledM5;
    uint16_t frame_cnt;
} Display_t;

//--------------------------------------------------------------------
// Function prototype
//--------------------------------------------------------------------
extern void display_Init(Display_t *obj);
extern void display_WriteBus(uint16_t data);
extern void display_EnableDisplay(uint8_t display);
extern void display_DisableDisplay(uint8_t display);
extern void display_DisableAll();
// extern void display_DisplayNext();
extern void display_PrepareDataFloat(Display_t *obj, float voltage, float current);
extern void display_PrepareDataACCX3(Display_t *obj, settings_accx3_t data);
// extern void display_SetCharOnMemory(uint8_t bus_high, uint8_t bus_low, uint8_t display);
// extern void display_SetNumberOnMemory(uint8_t bus_high, uint8_t dot_high, uint8_t bus_low, uint8_t dot_low, uint8_t display);
extern uint8_t display_GetNumberData(uint8_t number, uint8_t display);
extern void display_Float2Digits(float value, Digits4_t *digits);
extern void display_ACCX32Digits(accx3_t value, Digits4_t *digits);
extern void display_update(Display_t *obj);

//--------------------------------------------------------------------
// General Variables
//--------------------------------------------------------------------
extern HAL_74HC595_t display_obj;
extern settings_accx3_t actualData;
extern Display_t display;

#endif /* SRC_DISPLAY_H_ */
